app/Http/Controllers/Auth/AuthenticatedSessionController.php

select * from `work_spaces` where `domain` = '127.0.0.1' or `subdomain` = '127.0.0.1' and `created_by` = 5 limit 1
---
            if($local != $remote)
            {
                $remote = str_replace('www.', '', $remote);
                $workSpace = WorkSpace::where('domain',$remote)->orwhere('subdomain',$remote)->where('created_by',creatorId())->first();

select * from `users` where `id` = 5 limit 1
---
        }
        elseif(Auth::user()->type == 'company')
        {
            $user = User::where('id', Auth::user()->id)->first();