Modules/ProductService/Http/Controllers/ProductServiceController.php

select `product_services`.*, GROUP_CONCAT(taxes.name) as tax_names from `product_services` left join (`taxes` cross join (SELECT 1 n UNION SELECT 2 UNION SELECT 3 UNION SELECT 4) numbers) on `taxes`.`id` = SUBSTRING_INDEX(SUBSTRING_INDEX(product_services.tax_id, ',', numbers.n), ',', -1) and CHAR_LENGTH(product_services.tax_id) - CHAR_LENGTH(REPLACE(product_services.tax_id, ",", "")) + 1 >= numbers.n where `product_services`.`created_by` = 2 and `product_services`.`workspace_id` = 1 group by `product_services`.`id`
---
    public function index(Request $request)
    {
        if(Auth::user()->isAbleTo('product&service manage'))
        {
            $category = Category::where('created_by', '=', creatorId())->where('workspace_id', '=', getActiveWorkSpace())->where('type', '=', 0)->get()->pluck('name', 'id');
            $product_type = ProductService::$product_type;
            if(module_is_active('RentalManagement')) {
                $product_type['rent'] = 'Rent';
            }
            if(module_is_active('MusicInstitute')) {
                $product_type['music institute'] = 'Music Institute';
            }
            $productServices = ProductService::select('product_services.*', DB::raw('GROUP_CONCAT(taxes.name) as tax_names'))
            ->leftJoin('taxes', function ($join) {
                $join->on('taxes.id', '=', DB::raw("SUBSTRING_INDEX(SUBSTRING_INDEX(product_services.tax_id, ',', numbers.n), ',', -1)"))
                    ->crossJoin(DB::raw('(SELECT 1 n UNION SELECT 2 UNION SELECT 3 UNION SELECT 4) numbers'))
                    ->whereRaw('CHAR_LENGTH(product_services.tax_id) - CHAR_LENGTH(REPLACE(product_services.tax_id, ",", "")) + 1 >= numbers.n');
            })
            ->where('product_services.created_by', creatorId())
            ->where('product_services.workspace_id', getActiveWorkSpace())
            ->groupBy('product_services.id');
            if (!empty($request->category))
            {
                $productServices = $productServices->where('product_services.category_id', $request->category);
            }
            if (!empty($request->item_type))
            {
                $productServices = $productServices->where('product_services.type', $request->item_type);
            }
                $productServices = $productServices->with(['categorys','units'])->get();