app/Http/Controllers/UserController.php

    public function index(Request $request)
    {

        if(Auth::user()->isAbleTo('user manage'))
        {
            if(Auth::user()->type == 'super admin')
            {
                $users = User::where('type','company')->get();
            }
            else
            {
                if(Auth::user()->isAbleTo('workspace manage'))
                {
                    $users = User::where('created_by',creatorId())->where('workspace_id',getActiveWorkSpace())->get();
---
select * from `users` where `type` = 'company'
select * from `users` where `created_by` = 2 and `workspace_id` = 1

    public function create()
    {
        if(Auth::user()->isAbleTo('user create'))
        {
            $roles = Role::where('created_by',\Auth::user()->id)->pluck('name','id');
---
select `name`, `id` from `roles` where `created_by` = 2