app/Models/Invoice.php

    public function invoiceTotalCreditNote()
    {
        if(module_is_active('Account'))
        {
            return $this->hasMany(\Modules\Account\Entities\CreditNote::class, 'invoice', 'id')->sum('amount');
---
select sum(`amount`) as aggregate from `credit_notes` where `credit_notes`.`invoice` is null and `credit_notes`.`invoice` is not null