app/Models/User.php

select * from `work_spaces` where `work_spaces`.`id` = 1 limit 1
---
    public function ActiveWorkspaceName()
    {
        $name = $this->name;
        $workspace = WorkSpace::find(getActiveWorkSpace());

select count(*) as aggregate from `users` where `type` = 'company' and `created_by` = 1
---
    public function countCompany()
    {
        return User::where('type', '=', 'company')->where('created_by', '=',creatorId())->count();

select count(*) as aggregate from `users` where `type` = 'company' and `active_plan` not in (0, 1) and `created_by` = 1
---
    public function countPaidCompany()
    {
        return  User::where('type', '=', 'company')->whereNotIn('active_plan', [0,1])->where('created_by', '=', creatorId())->count();